---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.CurrencyPerWatt
source: html/cdf2d9a5-c281-e9c0-15d9-4fcc226c23f9.htm
---
# Autodesk.Revit.DB.UnitTypeId.CurrencyPerWatt Property

Cost per watt.

## Syntax (C#)
```csharp
public static ForgeTypeId CurrencyPerWatt { get; }
```